Revit 2027 API
ParameterTypeId.RailingPathCurveJoinOption Property
 "Rail Join": Built-in param used for overriding railing curve joins in a sketch via UI
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RailingPathCurveJoinOption { get; }
Public Shared ReadOnly Property RailingPathCurveJoinOption As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RailingPathCurveJoinOption {
	ForgeTypeId^ get ();
}
static member RailingPathCurveJoinOption : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace